app/Http/Controllers/DonacionesController.php

    public function index()
    {
        $donaciones = Donaciones::OrderBy('id')->get();
---
select * from `donaciones` order by `id` asc