app/Http/Controllers/HomeController.php

    public function destroy($id)
    {
        $imagen = tabla_imagenes_carrusel::get()->find($id);
        $url = $imagen->imagen;
        $location = str_replace("/storage", "public", $url);
        \Storage::delete($location);
        $imagen->delete();
---
delete from `tabla_imagenes_carrusels` where `id` = 2